src/integ-test/bdd-test/resources/xml/sendPaymentOutcomeV2Body_4paymentToken_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:sendPaymentOutcomeV2Request>
            <idPSP>$idPSP</idPSP>
            <idBrokerPSP>$idBrokerPSP</idBrokerPSP>
            <idChannel>$idChannel</idChannel>
            <password>$password</password>
            <paymentTokens>
                <paymentToken>$payToken1</paymentToken>
                <paymentToken>$payToken2</paymentToken>
                <paymentToken>$payToken3</paymentToken>
                <paymentToken>$payToken4</paymentToken>
            </paymentTokens>
            <outcome>$outcome</outcome>
        </nod:sendPaymentOutcomeV2Request>
    </soapenv:Body>
</soapenv:Envelope>